#+TITLE: August 15-30, 2019 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2019-08-15 Thu>
  :wpd-sandeepk: 1
  :wpd-jasonbraganza: 3 
  :END:
** jasonbraganza
*** NIOS - Geography - 2 [0/6]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:
   :OWNER: jasonbraganza
   :ID: READ.1566209210
   :TASKID: READ.1566209210
   :END:
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
*** Mentor Assigned Programming / Tech Problems - 1 [0/6]
   :PROPERTIES:
   :ESTIMATED: 12
   :ACTUAL:
   :OWNER: jasonbraganza
   :ID: DEV.1566208948
   :TASKID: DEV.1566208948
   :END:
    - [ ] Tackle problem (2h)
    - [ ] Tackle problem (2h)
    - [ ] Tackle problem (2h)
    - [ ] Tackle problem (2h)
    - [ ] Tackle problem (2h)
    - [ ] Tackle problem (2h)
*** Python Jumpstart by Building 10 Apps - 2 [0/6]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:   0.00
    :OWNER: jasonbraganza
    :ID: DEV.1564482384
    :TASKID: DEV.1564482384
    :END:
    :LOGBOOK:
    :END:
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
*** IN_PROGRESS Read Lutz Learning Python - 2 [0/6]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:   0.50
    :OWNER: jasonbraganza
    :ID: READ.1564479823
    :TASKID: READ.1564479823
    :END:      
    :LOGBOOK:
    CLOCK: [2019-08-20 TUe 14:30]--[2019-08-20 Tue 15:00] =>  0:30
    :END:
    - [ ] Read Learning Python (1h)
    - [ ] Read Learning Python (1h)
    - [ ] Read Learning Python (1h)
    - [ ] Read Learning Python (1h)
    - [ ] Read Learning Python (1h)
    - [ ] Read Learning Python (1h)
*** IN_PROGRESS Work at French, in the Fluent forever app - Part VI [7/16]
   :PROPERTIES:
   :ESTIMATED: 16
   :ACTUAL:   8.02
   :OWNER: jasonbraganza
   :ID: WRITE.1557903518
   :TASKID: WRITE.1557903518
   :END:
    :LOGBOOK:
    CLOCK: [2019-08-21 Wed 06:30]--[2019-08-21 Wed 07:30] =>  1:00
    CLOCK: [2019-08-20 Tue 07:30]--[2019-08-20 Tue 08:41] =>  1:11
    CLOCK: [2019-08-19 Mon 07:30]--[2019-08-19 Mon 08:15] =>  0:45
    CLOCK: [2019-08-18 Sun 06:15]--[2019-08-18 Sun 07:30] =>  1:15
    CLOCK: [2019-08-17 Sat 07:00]--[2019-08-17 Sat 08:20] =>  1:20
    CLOCK: [2019-08-16 Fri 07:00]--[2019-08-16 Fri 08:15] =>  1:15
    CLOCK: [2019-08-15 Thu 07:00]--[2019-08-15 Thu 08:15] =>  1:15
    :END:      
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
*** Write twice a week - 4 [0/4]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   
    :OWNER: jasonbraganza
    :ID: WRITE.1559630427
    :TASKID: WRITE.1559630427
    :END:
    :LOGBOOK:
    :END:
    - [ ] Write a short blog post. (1h)
    - [ ] Write a short blog post. (1h)
    - [ ] Write a short blog post. (1h)
    - [ ] Write a short blog post. (1h)
*** Read books - 3 [0/16]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   0.00
    :OWNER: jasonbraganza
    :ID: READ.1559630918
    :TASKID: READ.1559630918
    :END:
    :LOGBOOK:
    :END:
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
** sandeepk
*** IN_PROGRESS [#B] Dive into Python3 [3/4]
    :PROPERTIES:
    :ACTUAL:   9.92
    :ESTIMATED: 16 
    :OWNER: sandeepk
    :ID: READ.1559639223
    :TASKID: READ.1559639223
    :END:
    :LOGBOOK:
    CLOCK: [2019-08-28 Wed 20:05]--[2019-08-28 Wed 20:55] =>  0:50
    CLOCK: [2019-08-28 Wed 16:10]--[2019-08-28 Wed 16:55] =>  0:45
    CLOCK: [2019-08-27 Tue 22:30]--[2019-08-27 Tue 23:30] =>  1:00
    CLOCK: [2019-08-26 Mon 16:00]--[2019-08-26 Mon 17:15] =>  1:15
    CLOCK: [2019-08-25 Sun 22:00]--[2019-08-25 Sun 23:30] =>  1:30
    CLOCK: [2019-08-25 Sun 19:00]--[2019-08-25 Sun 20:45] =>  1:45
    CLOCK: [2019-08-25 Sun 14:00]--[2019-08-25 Sun 15:00] =>  1:00
    CLOCK: [2019-08-24 Sat 22:40]--[2019-08-24 Sat 23:40] =>  1:00
    CLOCK: [2019-08-24 Sat 17:00]--[2019-08-24 Sat 17:50] =>  0:50
    :END:
    - [X] Chapter 2 Native Datatypes     (3h)
    - [X] Chpater 3 Comprehensions       (4h)
    - [X] Chapter 4 Strings              (6h)
    - [ ] Chapter 5 Regular Expressions  (3h)

